app/views/general_answers/index.html.erb

    <% @questions.each do |question| %>
      <% @answer = GeneralAnswer.find_by_general_question_id_and_person_id( question.id, @applicant.id ) %>
---
SELECT `general_answers`.* FROM `general_answers` WHERE `general_answers`.`general_question_id` = 1 AND `general_answers`.`person_id` = 14 LIMIT 1