iHireBuild1.0/app/controllers/positions_search_controller.rb

SELECT `positions`.* FROM `positions` ORDER BY position_post_datetime
---
  def results
    @positions = Position.all