app/controllers/admin/questions_controller.rb

  def index

    @questions = Question.all
---
SELECT `questions`.* FROM `questions`

  def show
    @question = Question.find(params[:id])
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1

  def edit
    @question = Question.find(params[:id])
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1

  def destroy
    @question = Question.find(params[:id])
    @question.destroy
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 2 LIMIT 1
DELETE FROM `questions` WHERE `questions`.`id` = 2