app/controllers/general_questions_controller.rb

SELECT `general_questions`.* FROM `general_questions`
---
  def index
    @general_questions = GeneralQuestion.all

SELECT `general_questions`.* FROM `general_questions` WHERE `general_questions`.`id` = 1 LIMIT 1
---
  def show
    @general_question = GeneralQuestion.find(params[:id])

SELECT `general_questions`.* FROM `general_questions` WHERE `general_questions`.`id` = 1 LIMIT 1
---
  def edit
    @general_question = GeneralQuestion.find(params[:id])

INSERT INTO `general_questions` (`question`, `created_at`, `updated_at`) VALUES ('', '2011-03-11 17:08:22', '2011-03-11 17:08:22')
---
  def create
    @general_question = GeneralQuestion.new(params[:general_question])

    respond_to do |format|
      if @general_question.save

SELECT `general_questions`.* FROM `general_questions` WHERE `general_questions`.`id` = 1 LIMIT 1
UPDATE `general_questions` SET `question` = 'hey', `updated_at` = '2011-03-11 17:08:30' WHERE `general_questions`.`id` = 1
---
  def update
    @general_question = GeneralQuestion.find(params[:id])

    respond_to do |format|
      if @general_question.update_attributes(params[:general_question])

SELECT `general_questions`.* FROM `general_questions` WHERE `general_questions`.`id` = 1 LIMIT 1
DELETE FROM `general_questions` WHERE `general_questions`.`id` = 1
---
  def destroy
    @general_question = GeneralQuestion.find(params[:id])
    @general_question.destroy