app/controllers/general_questions_controller.rb

  def index
    @applicant = Person.find(params[:applicant])
    @page_title = "Application General Questions"
    build_all_answers @applicant
    @questions = GeneralQuestion.all
    @answers = @applicant.general_answers.all
---
SELECT `general_answers`.* FROM `general_answers` WHERE `general_answers`.`general_question_id` = 1 AND `general_answers`.`person_id` = 6 LIMIT 1