app/controllers/general_answers_controller.rb

  def index
    @applicant = Person.find(params[:applicant])
    @page_title = "Application General Questions"
    build_all_answers @applicant
    @questions = GeneralQuestion.all
    @answers = @applicant.general_answers.all
---
SELECT `general_questions`.* FROM `general_questions`
SELECT `general_answers`.* FROM `general_answers` WHERE `general_answers`.`person_id` = 20

  def show
    @applicant = Person.find(params[:id])
    @questions = GeneralQuestion.all
    @answers = @applicant.general_answers.all
---
SELECT `general_questions`.* FROM `general_questions`
SELECT `general_answers`.* FROM `general_answers` WHERE `general_answers`.`id` = 1 AND (`general_answers`.person_id = 26) LIMIT 1