app/controllers/job_applications_controller.rb

SELECT `application_states`.* FROM `application_states` WHERE `application_states`.`id` = 2 LIMIT 1
---
    def next
      @application_state = ApplicationState.find(params[:state])