app/controllers/job_questions_controller.rb

SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
---
  def index
    @title = "Application Questions"
    @question = Question.find(1)

SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
SELECT `answers`.* FROM `answers` WHERE `answers`.`id` = 1 LIMIT 1
---
  def results
    @question = Question.find(1)
    @answer = Answer.find(params[:id])

SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
INSERT INTO `answers` (`name`, `answer`, `created_on`) VALUES ('Joshua', 'No', '2011-03-12 06:20:32')
---
  def create
    @answer = Answer.new(params[:answer])
    @question = Question.find(1)
    respond_to do |format|
      if @answer.save