app/controllers/job_applications_controller.rb

SELECT `application_states`.* FROM `application_states` WHERE `application_states`.`id` = 20 LIMIT 1
SELECT `positions`.* FROM `positions` WHERE `positions`.`id` = 1 ORDER BY updated_on LIMIT 1
INSERT INTO `application_states` (`state`, `created_at`, `updated_at`) VALUES ('new_applicant', '2011-04-09 07:08:35', '2011-04-09 07:08:35')
---
  def index
    @page_title = "General Questions"
    if !params[:position]
      redirect_to positions_search_path
    end
    if params[:state]
      @application_state = ApplicationState.find(params[:state])
    else

    #the application process is starting, so do some intial setup to get things going.
      @applicant = Person.new
      @applicant.save
    #@applicant.application_state = @application_state
     @applicant.build_application_state
     @applicant.position = Position.find(params[:position])
     @applicant.save

INSERT INTO `application_states` (`state`, `created_at`, `updated_at`) VALUES ('new_applicant', '2011-04-09 07:08:38', '2011-04-09 07:08:38')
UPDATE `application_states` SET `state` = 'general_questions', `updated_at` = '2011-04-09 07:10:10' WHERE `application_states`.`id` = 5
---
  def next
      @applicant = Person.find(params[:applicant])
      @state = @applicant.application_state
      @state.next
      @state.save

UPDATE `application_states` SET `state` = 'application_complete', `updated_at` = '2011-04-20 07:13:30' WHERE `application_states`.`id` = 16
SELECT `application_states`.* FROM `application_states` WHERE `application_states`.`id` = 16 LIMIT 1
---
  def complete
    @applicant = Person.find(params[:applicant])
    @state = @applicant.application_state
    if ! @state.application_complete?
      redirect_to 'next'
    end
    @state.close
    @state.save
    @applicant = Person.find(params[:applicant])