app/controllers/positions_search_controller.rb

  def index
    @title = "Open Position Search Controller"
    #grab a list of properties for the dropdowns
    #@locations = Position.find(:all, :select => "DISTINCT(location)").map(&:location)
    #@locations = array_from_position_attribute(location)
    #@departments = Position.find(:all, :select => "DISTINCT(department)").map(&:department)
    @positions = Position.all
---
SELECT `positions`.* FROM `positions` WHERE (title like '%associate%' and location like '%' and department like 'Livestock' and is_open = 1) ORDER BY updated_on

  def results
    @positions = Position.all
---
SELECT `positions`.* FROM `positions` ORDER BY position_post_datetime